Revit 2027 API
BuiltInFailures.PlanRegionFailures.Intersecting Property
 The boundaries of the highlighted Plan Regions overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId Intersecting { get; }
Public Shared ReadOnly Property Intersecting As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Intersecting {
	FailureDefinitionId^ get ();
}
static member Intersecting : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PlanRegionFailures Class
Autodesk.Revit.DB Namespace